<template>
    <main class="container">
    <div>
      <h1>
        Главные хиты 2021
      </h1>
    </div>
    <section class="products">
      <div  class="v-for" v-for="product in products">
        <Product :product="product"></Product>
      </div>
    </section>
    </main>

</template>

<script>
import Product from "./Product";

export default {
  name: "MainPage",
  components: {
    Product
  },
  data(){
    return{
      products: [
        {
        id: 1,
        title: 'Тесс с дороги.',
        author: 'Рэйчел Хартман',
        description: 'В средневековом королевстве Горедд женщины должны быть леди, мужчины - их защитниками, а драконы могут быть кем хотят. Тесс, упрямо, является нарушительницей спокойствия. Вы не можете устроить сцену на свадьбе своей сестры и сломать нос родственнику одним ударом (каким бы напыщенным он ни был) и не пострадать от последствий. Поскольку ее семья планирует отправить ее в монастырь, Тесс натягивает сапоги и отправляется в путешествие по Южным землям, одна и притворяясь мальчиком.',
        price: 799,
        image:  require('../assets/images/books/1.jpg')
      },
        {
          id: 2,
          title: 'Тесс с дороги.',
          author: 'Рэйчел Хартман',
          description: 'В средневековом королевстве Горедд женщины должны быть леди, мужчины - их защитниками, а драконы могут быть кем хотят. Тесс, упрямо, является нарушительницей спокойствия. Вы не можете устроить сцену на свадьбе своей сестры и сломать нос родственнику одним ударом (каким бы напыщенным он ни был) и не пострадать от последствий. Поскольку ее семья планирует отправить ее в монастырь, Тесс натягивает сапоги и отправляется в путешествие по Южным землям, одна и притворяясь мальчиком.',
          price: 799,
          image:  require('../assets/images/books/1.jpg')
        },
        {
          id: 2,
          title: 'Тесс с дороги.',
          author: 'Рэйчел Хартман',
          description: 'В средневековом королевстве Горедд женщины должны быть леди, мужчины - их защитниками, а драконы могут быть кем хотят. Тесс, упрямо, является нарушительницей спокойствия. Вы не можете устроить сцену на свадьбе своей сестры и сломать нос родственнику одним ударом (каким бы напыщенным он ни был) и не пострадать от последствий. Поскольку ее семья планирует отправить ее в монастырь, Тесс натягивает сапоги и отправляется в путешествие по Южным землям, одна и притворяясь мальчиком.',
          price: 799,
          image:  require('../assets/images/books/1.jpg')
        },
        {
          id: 2,
          title: 'Тесс с дороги.',
          author: 'Рэйчел Хартман',
          description: 'В средневековом королевстве Горедд женщины должны быть леди, мужчины - их защитниками, а драконы могут быть кем хотят. Тесс, упрямо, является нарушительницей спокойствия. Вы не можете устроить сцену на свадьбе своей сестры и сломать нос родственнику одним ударом (каким бы напыщенным он ни был) и не пострадать от последствий. Поскольку ее семья планирует отправить ее в монастырь, Тесс натягивает сапоги и отправляется в путешествие по Южным землям, одна и притворяясь мальчиком.',
          price: 799,
          image:  require('../assets/images/books/1.jpg')
        },
        {
          id: 2,
          title: 'Тесс с дороги.',
          author: 'Рэйчел Хартман',
          description: 'В средневековом королевстве Горедд женщины должны быть леди, мужчины - их защитниками, а драконы могут быть кем хотят. Тесс, упрямо, является нарушительницей спокойствия. Вы не можете устроить сцену на свадьбе своей сестры и сломать нос родственнику одним ударом (каким бы напыщенным он ни был) и не пострадать от последствий. Поскольку ее семья планирует отправить ее в монастырь, Тесс натягивает сапоги и отправляется в путешествие по Южным землям, одна и притворяясь мальчиком.',
          price: 799,
          image:  require('../assets/images/books/1.jpg')
        }

      ]
    }
  }
}
</script>

<style scoped src="../assets/styles/main_style.css">

</style>